{
  "backend/main.mo": "Main backend canister implementing access control, user profiles, valid symbol management, watchlists, and cycle‑safe HTTP outcall checks.",
  "backend/migration.mo": "Migration script adding validSymbols and userWatchlists while preserving existing userProfiles.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file summarizing key frontend files and their responsibilities for build planning.",
  "frontend/docs/coingecko-debug-dfx.md": "Developer guide for deploying and testing CoinGecko debug fetch functionality using dfx.",
  "frontend/index.html": "Base HTML file mounting the React application via root div and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component coordinating identity, actor initialization, routing, profile gating, and page rendering.",
  "frontend/src/components/AddCryptoDialog.tsx": "Dialog component that loads valid symbols, displays a searchable picker, and adds selected symbols to the user's watchlist.",
  "frontend/src/components/BackendTesterEntryPoint.tsx": "Admin-checking button that handles loading, error, and non-admin states with tooltips and navigation.",
  "frontend/src/components/ConfigErrorBoundary.tsx": "Empty or placeholder file for a configuration-related error boundary.",
  "frontend/src/components/ConnectionBootstrapper.tsx": "Manages backend actor initialization, timeouts, and recovery UI before rendering children.",
  "frontend/src/components/ConnectionDetails.tsx": "Expandable debug panel showing authentication, actor state, diagnostics, and error info with copy-to-clipboard support.",
  "frontend/src/components/ConnectionRecoveryDialog.tsx": "Empty or placeholder component for connection recovery dialog.",
  "frontend/src/components/CryptoCard.tsx": "Displays live market data for a crypto symbol with error handling and opens a detailed dialog.",
  "frontend/src/components/CryptoDetailDialog.tsx": "Dialog showing forecast charts and settings for a crypto symbol with resettable state per open.",
  "frontend/src/components/Footer.tsx": "Simple footer with attribution and a disclaimer.",
  "frontend/src/components/ForecastChart.tsx": "Fetches historical prices, computes regression and moving averages, and renders forecast chart data with error states.",
  "frontend/src/components/ForecastSettingsPanel.tsx": "UI panel allowing users to adjust moving average periods and forecast horizons using sliders.",
  "frontend/src/components/Header.tsx": "Application header handling theme toggling, authentication, and optional user registration.",
  "frontend/src/components/LoginPrompt.tsx": "Landing prompt presenting app features and a login button using Internet Identity.",
  "frontend/src/components/PriceEntryManager.tsx": "Empty file with no implemented content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for users to enter and save their profile name during initial setup.",
  "frontend/src/components/SimulatedBashPanel.tsx": "Interactive terminal-like panel executing backend commands with reconnection logic and admin controls.",
  "frontend/src/components/SymbolPicker.tsx": "Searchable list component for selecting cryptocurrency symbols.",
  "frontend/src/components/WatchlistManager.tsx": "Card UI for future watchlist features, currently showing a placeholder alert.",
  "frontend/src/components/WatchlistPriceTickRow.tsx": "Displays a single crypto’s live price, 24h change, and errors using live market data queries.",
  "frontend/src/components/WatchlistPriceTicks.tsx": "Renders a card listing multiple WatchlistPriceTickRow components or an empty-state alert.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useActorEnhanced.ts": "Adds diagnostics, timeout handling, and retry logic on top of useActor for more robust actor initialization.",
  "frontend/src/hooks/useConnectionRecovery.ts": "Empty placeholder file for future connection recovery logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, stored identity loading, and related state management.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for user profile, admin checks, user roles, and live/historical crypto market data via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark theme color tokens and base styling.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider, then mounts App.",
  "frontend/src/pages/BackendTesterPage.tsx": "Admin-aware page that displays backend diagnostic info and a simulated command console with access checks and error panels.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard showing watchlist tools, price ticks, and popular crypto cards, with optional navigation to backend tester.",
  "frontend/src/utils/backendTesterCommands.ts": "Defines backend tester command metadata and execution logic, including parsing and categorization for various backend operations.",
  "frontend/src/utils/coinGeckoHistoricalData.ts": "Parses CoinGecko historical price responses into normalized timestamp/price arrays with error handling.",
  "frontend/src/utils/coinGeckoMarketData.ts": "Parses CoinGecko market data responses and formats price and market cap values for display.",
  "frontend/src/utils/connectionErrors.ts": "Provides helpers to detect cycle, configuration, and network errors and normalize them into user-friendly messages.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and session-stored values for routing and state retention.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom OKLCH color tokens, extended components, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project state metadata including current progress, architectural notes, known issues, and existing feature records."
}