{
  "backend/main.mo": "Implements user profile storage with access control, allowing users to view and save their own profiles and admins to view any profile.",
  "feature_evidence.json": "Contains feature evidence reports mapping feature IDs to affected files, components, and test cases.",
  "frontend-file-summaries.txt": "Lists prewritten summaries for various frontend files in JSON form.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app logic handling identity initialization, routing between dashboard and backend tester, and profile setup flow.",
  "frontend/src/components/AddCryptoDialog.tsx": "Dialog for adding cryptocurrencies that currently displays a notice that backend crypto support is not implemented.",
  "frontend/src/components/BackendTesterEntryPoint.tsx": "Button component that checks admin status and navigates to the Backend Tester in full or limited mode with loading and error states.",
  "frontend/src/components/ConfigErrorBoundary.tsx": "Empty placeholder component intended for configuration-related error handling.",
  "frontend/src/components/ConnectionBootstrapper.tsx": "Manages backend actor initialization with timeout, error handling, re-authentication, and retry UI around connection state.",
  "frontend/src/components/ConnectionDetails.tsx": "Expandable card showing connection diagnostics and a copyable debug summary.",
  "frontend/src/components/ConnectionRecoveryDialog.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/CryptoCard.tsx": "Displays mock crypto market data with price, market cap, and opens a detail dialog.",
  "frontend/src/components/CryptoDetailDialog.tsx": "Dialog showing forecast chart and settings for a selected crypto symbol.",
  "frontend/src/components/Footer.tsx": "Static footer with attribution and a disclaimer about crypto risks.",
  "frontend/src/components/ForecastChart.tsx": "Generates mock historical data, computes regression and moving averages, and renders a forecast chart.",
  "frontend/src/components/ForecastSettingsPanel.tsx": "Panel for adjusting moving average period and forecast horizon via sliders.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling theme toggle, authentication, user registration, and tester navigation.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a login prompt highlighting app features and triggers Internet Identity login.",
  "frontend/src/components/PriceEntryManager.tsx": "Empty file with no implementation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal allowing users to submit their name and save their profile using backend mutation.",
  "frontend/src/components/SimulatedBashPanel.tsx": "Interactive terminal-like panel for executing backend commands with reconnection logic, admin checks, and real-time output handling.",
  "frontend/src/components/WatchlistManager.tsx": "UI for managing a watchlist, currently showing demo-mode notice due to missing backend features.",
  "frontend/src/components/WatchlistPriceTicks.tsx": "Displays live price tick section but shows demo-mode alert since backend support is not implemented.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useActorEnhanced.ts": "Wraps useActor with diagnostics, timeout handling, and retry flows for improved backend connection resilience.",
  "frontend/src/hooks/useConnectionRecovery.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, state tracking, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for user profiles, admin checks, and placeholder crypto functions.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables plus base styling.",
  "frontend/src/main.tsx": "Application entry point initializing React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/BackendTesterPage.tsx": "UI page displaying admin diagnostics, identity info, and backend test utilities with access gating.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard showing watchlist, price ticks, and popular crypto cards with optional tester navigation.",
  "frontend/src/utils/backendTesterCommands.ts": "Defines demo backend command configurations for market, symbol, registration, and admin operations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom color tokens, animations, and plugins for typography, container queries, and animation utilities.",
  "project_state.json": "Project metadata describing app purpose, issues with tester scrolling and demo/live mode messaging, and associated feature requests."
}