{
  "backend/main.mo": "Defines core types, user/admin state, watchlists, alerts, and command registry for the Motoko backend with access control and symbol management.",
  "feature_evidence.json": "Empty feature evidence report with no recorded features.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend source files for documentation or analysis.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx into the root element.",
  "frontend/src/App.tsx": "Main React app managing identity, routing, profile setup, and navigation between dashboard and backend tester.",
  "frontend/src/components/AddCryptoDialog.tsx": "Dialog for selecting and adding a cryptocurrency to the user's watchlist with loading and error handling.",
  "frontend/src/components/BackendTesterEntryPoint.tsx": "Entry button for Backend Tester with admin check, loading/error states, and limited-mode access for non-admins.",
  "frontend/src/components/ConfigErrorBoundary.tsx": "Empty or placeholder file for a configuration-related error boundary component.",
  "frontend/src/components/ConnectionBootstrapper.tsx": "Manages authentication, actor initialization, and timeout handling, showing loading or error states and allowing retries or re-authentication.",
  "frontend/src/components/ConnectionDetails.tsx": "Expandable debug panel displaying connection and authentication diagnostic fields with copy‑to‑clipboard support.",
  "frontend/src/components/ConnectionRecoveryDialog.tsx": "Empty file or placeholder for a future recovery dialog component.",
  "frontend/src/components/CryptoCard.tsx": "Displays live crypto market data with loading, error, and registration handling, and opens a detail dialog on interaction.",
  "frontend/src/components/CryptoDetailDialog.tsx": "Dialog showing forecast chart and settings for a selected cryptocurrency with per-session state.",
  "frontend/src/components/Footer.tsx": "Static footer with branding and a risk disclaimer.",
  "frontend/src/components/ForecastChart.tsx": "Generates mock historical data, computes forecasts and indicators, and renders a detailed chart for a crypto symbol.",
  "frontend/src/components/ForecastSettingsPanel.tsx": "Provides sliders and controls for adjusting moving average period and forecast horizon parameters.",
  "frontend/src/components/Header.tsx": "Header with theme toggle, authentication handling, user registration, and optional backend tester entry.",
  "frontend/src/components/LoginPrompt.tsx": "Login prompt showing platform features and a button to authenticate via Internet Identity.",
  "frontend/src/components/PriceEntryManager.tsx": "Empty component file with no implemented logic.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and saving a user's name during initial profile setup.",
  "frontend/src/components/SimulatedBashPanel.tsx": "Simulated command-line panel with backend command execution, reconnection logic, and admin access checks.",
  "frontend/src/components/WatchlistManager.tsx": "UI for displaying, adding, and removing cryptocurrencies from the user's watchlist.",
  "frontend/src/components/WatchlistPriceTicks.tsx": "Displays live price data for each watchlist entry with loading, error, and formatted price states.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useActorEnhanced.ts": "Extends useActor with authentication diagnostics, timeout handling, and admin‑init retry logic.",
  "frontend/src/hooks/useConnectionRecovery.ts": "Empty placeholder file for future connection recovery logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an auth context for managing Internet Identity login, stored identity loading, and state helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, roles, admin actions, and other backend operations using the actor.",
  "frontend/src/index.css": "Tailwind base styles plus CSS variables for light and dark theme tokens.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/BackendTesterPage.tsx": "Admin and diagnostics page showing identity, role, and backend access status with testing utilities.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard showing watchlist, market data, and entry point to backend tester.",
  "frontend/src/utils/backendTesterCommands.ts": "Defines command metadata and execution logic for the Backend Tester panel, including registration, connectivity, diagnostics, and admin actions calling backend actor methods.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read URL parameters, persist them in sessionStorage, and remove them from hash-based routes.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, themes, animations, plugins, and container settings for the frontend UI.",
  "project_state.json": "Describes the project’s current architecture, features, and development focus for an ICP React + Motoko application."
}