{
  "backend/main.mo": "Actor with access control, user profiles, cycle checks, CoinGecko URL builders, and outcall safety logic for live market data.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Reference list of prewritten summaries for various frontend source files.",
  "frontend/docs/coingecko-debug-dfx.md": "Guide describing how to deploy and test raw CoinGecko API responses using a debug function via dfx.",
  "frontend/index.html": "Base HTML entrypoint that loads the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Main React app handling identity, actor initialization, routing, profile setup, and page selection between dashboard and backend tester.",
  "frontend/src/components/AddCryptoDialog.tsx": "Dialog UI for adding cryptocurrencies that currently shows a placeholder message indicating backend crypto features are not implemented.",
  "frontend/src/components/BackendTesterEntryPoint.tsx": "Component rendering a Backend Tester navigation button with admin checks, loading/error states, and limited-mode access for non-admins.",
  "frontend/src/components/ConfigErrorBoundary.tsx": "Empty placeholder file for a configuration-related error boundary component.",
  "frontend/src/components/ConnectionBootstrapper.tsx": "Manages authentication and backend actor initialization with timeout handling and error recovery UI.",
  "frontend/src/components/ConnectionDetails.tsx": "Displays expandable debug details about connection state, diagnostics, and errors with copy-to-clipboard support.",
  "frontend/src/components/ConnectionRecoveryDialog.tsx": "Empty placeholder file for a connection recovery dialog component.",
  "frontend/src/components/CryptoCard.tsx": "Shows live crypto market data, handling cycle exhaustion and other errors, and opens a detail dialog on interaction.",
  "frontend/src/components/CryptoDetailDialog.tsx": "Presents a dialog with forecast charts and settings for a selected cryptocurrency, resetting state on open.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with attribution and investment risk disclaimer.",
  "frontend/src/components/ForecastChart.tsx": "Fetches and visualizes historical crypto prices with linear regression, moving averages, and future forecasts.",
  "frontend/src/components/ForecastSettingsPanel.tsx": "Provides sliders to adjust moving-average period and forecast horizon for crypto analysis.",
  "frontend/src/components/Header.tsx": "Header component handling theme switching, authentication, and user registration with Internet Identity and backend hooks.",
  "frontend/src/components/LoginPrompt.tsx": "Login prompt displaying platform features and triggering Internet Identity authentication.",
  "frontend/src/components/PriceEntryManager.tsx": "Empty component file with no implemented logic.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and saving a user's name during profile setup using a backend mutation.",
  "frontend/src/components/SimulatedBashPanel.tsx": "Simulated terminal interface supporting backend commands, auto-reconnection, admin checks, and scrolling output management.",
  "frontend/src/components/WatchlistManager.tsx": "UI card for managing a watchlist, currently showing a placeholder alert for an upcoming feature.",
  "frontend/src/components/WatchlistPriceTickRow.tsx": "Row component fetching and displaying live market data for a single crypto symbol with error handling and price change indicators.",
  "frontend/src/components/WatchlistPriceTicks.tsx": "Card displaying live price tick rows for selected cryptocurrencies or an empty-state alert when none are selected.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, initializing access control and invalidating dependent queries when it changes.",
  "frontend/src/hooks/useActorEnhanced.ts": "Enhances the base actor hook with authentication checks, timeout handling, admin‑init diagnostics, and retry logic.",
  "frontend/src/hooks/useConnectionRecovery.ts": "Empty placeholder file for future connection‑recovery logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, admin checks, user roles, and crypto market data via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling.",
  "frontend/src/main.tsx": "Initializes React root and wraps the app with Internet Identity and React Query providers.",
  "frontend/src/pages/BackendTesterPage.tsx": "Admin and diagnostics page showing user identity, roles, backend access state, and tools for testing canister calls.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard displaying watchlists, live price ticks, and crypto cards, with optional navigation to the backend tester.",
  "frontend/src/utils/backendTesterCommands.ts": "Defines command metadata and execution logic for backend tester actions, including CoinGecko live market fetch commands with parsing utilities.",
  "frontend/src/utils/coinGeckoHistoricalData.ts": "Parses CoinGecko historical price data JSON into normalized timestamp/price arrays with error handling.",
  "frontend/src/utils/coinGeckoMarketData.ts": "Parses CoinGecko market data responses and provides helpers to format prices and market caps.",
  "frontend/src/utils/connectionErrors.ts": "Detects and normalizes backend connection and configuration errors, including cycle exhaustion and network issues.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, container settings, and plugins.",
  "project_state.json": "Describes current project state, architecture notes, issues, and existing feature requirements for backend live data and stability."
}