{
  "backend/main.mo": "Backend actor managing user profiles, access control, and CoinGecko API fetch functions including admin-only debug endpoints.",
  "feature_evidence.json": "Feature evidence report linking a documentation feature to its files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend files and their roles in the app.",
  "frontend/docs/coingecko-debug-dfx.md": "Developer guide explaining how to deploy and test raw CoinGecko API responses using the debug function via dfx.",
  "frontend/index.html": "HTML entry point mounting the frontend and loading the main TypeScript application bundle.",
  "frontend/src/App.tsx": "Main React application component handling identity bootstrapping, routing, profile setup, and authenticated view rendering.",
  "frontend/src/components/AddCryptoDialog.tsx": "Dialog component showing a notice that crypto watchlist functionality is not yet implemented.",
  "frontend/src/components/BackendTesterEntryPoint.tsx": "UI control for opening the Backend Tester with permission-aware states for admins and non-admin users.",
  "frontend/src/components/ConfigErrorBoundary.tsx": "Empty placeholder file intended for future error boundary implementation.",
  "frontend/src/components/ConnectionBootstrapper.tsx": "Wrapper handling actor initialization, authentication retries, timeouts, and connection error states before rendering children.",
  "frontend/src/components/ConnectionDetails.tsx": "Displays expandable debug info about authentication, actor status, admin initialization, and errors, with a copy-to-clipboard option.",
  "frontend/src/components/ConnectionRecoveryDialog.tsx": "Empty file or placeholder with no implemented content.",
  "frontend/src/components/CryptoCard.tsx": "Renders a crypto summary card using mock data with price, market cap, and change, and opens a detail dialog on interaction.",
  "frontend/src/components/CryptoDetailDialog.tsx": "Dialog showing chart and settings tabs for crypto analysis, managing forecast-related local state.",
  "frontend/src/components/Footer.tsx": "Displays site footer with attribution and a crypto risk disclaimer.",
  "frontend/src/components/ForecastChart.tsx": "Generates mock historical data and forecasts using linear regression and moving averages, rendering them in a Recharts line chart.",
  "frontend/src/components/ForecastSettingsPanel.tsx": "Provides sliders to adjust moving-average period and forecast horizon for the chart’s prediction settings.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling theme toggle, authentication, user registration, and optional backend tester navigation.",
  "frontend/src/components/LoginPrompt.tsx": "Displays a login prompt with feature cards and a button that initiates Internet Identity login.",
  "frontend/src/components/PriceEntryManager.tsx": "Empty component file with no implementation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal allowing users to enter and save their name using a backend mutation with validation and loading states.",
  "frontend/src/components/SimulatedBashPanel.tsx": "Interactive terminal-like panel that runs backend commands, manages reconnection logic, admin access, and auto-scrolling output.",
  "frontend/src/components/WatchlistManager.tsx": "UI card for managing a crypto watchlist, currently showing a demo-mode alert due to missing backend support.",
  "frontend/src/components/WatchlistPriceTicks.tsx": "Card showing real-time price tick section with a demo-mode alert indicating backend is not yet implemented.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useActorEnhanced.ts": "Enhanced actor hook adding diagnostics, timeout handling, admin-init tracking, and retry mechanisms for authentication issues.",
  "frontend/src/hooks/useConnectionRecovery.ts": "Empty hook file with no implementation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login flow, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profile, admin checks, registration stubs, and placeholder crypto data queries using an actor-based backend interface.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/BackendTesterPage.tsx": "Renders an admin-focused diagnostics and backend testing interface with permission checks and identity details.",
  "frontend/src/pages/Dashboard.tsx": "Displays the main dashboard with watchlist management, price tickers, and popular crypto cards.",
  "frontend/src/utils/backendTesterCommands.ts": "Defines command metadata and demo-mode implementations for backend tester features like market data and symbol management.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-based values.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom OKLCH color tokens, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state for a crypto backend canister and frontend, including feature requests, known issues, and required Motoko debug endpoints for CoinGecko HTTP outcalls."
}