{
  "backend/main.mo": "Motoko actor with access‑controlled user profiles, crypto symbol mapping, and CoinGecko HTTP outcall endpoints including admin‑only debug mode.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend components and hooks.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling identity bootstrapping, routing between dashboard and backend tester, and conditional profile setup.",
  "frontend/src/components/AddCryptoDialog.tsx": "Dialog showing disabled crypto‑add feature with a notice that backend support is not implemented.",
  "frontend/src/components/BackendTesterEntryPoint.tsx": "Entry button for the backend tester with admin checks, loading/error states, and limited‑mode navigation.",
  "frontend/src/components/ConfigErrorBoundary.tsx": "Empty placeholder file for a configuration error boundary.",
  "frontend/src/components/ConnectionBootstrapper.tsx": "Wrapper managing actor initialization, timeouts, retry flows, and identity re‑authentication before rendering children.",
  "frontend/src/components/ConnectionDetails.tsx": "Expandable card showing authentication, actor, admin, and diagnostic connection states with a clipboard copy feature.",
  "frontend/src/components/ConnectionRecoveryDialog.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/CryptoCard.tsx": "Displays a crypto card with mock price data, market info, and opens a detail dialog for deeper analysis.",
  "frontend/src/components/CryptoDetailDialog.tsx": "Dialog showing tabs for forecast charts and settings, maintaining per-session forecast parameters.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution and a disclaimer about cryptocurrency risks.",
  "frontend/src/components/ForecastChart.tsx": "Generates mock historical data, computes regression and moving averages, and renders a forecast chart with future predictions.",
  "frontend/src/components/ForecastSettingsPanel.tsx": "Panel providing sliders to adjust moving average period and forecast horizon for crypto analysis.",
  "frontend/src/components/Header.tsx": "Header with theme toggle, authentication handling, user registration, branding, and optional backend tester navigation.",
  "frontend/src/components/LoginPrompt.tsx": "A login landing page component displaying app features and triggering Internet Identity authentication.",
  "frontend/src/components/PriceEntryManager.tsx": "Empty file with no implemented logic or UI.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal prompting the user to enter a name and save their profile via a backend mutation.",
  "frontend/src/components/SimulatedBashPanel.tsx": "A simulated terminal panel that runs backend commands, handles reconnection logic, and displays command output.",
  "frontend/src/components/WatchlistManager.tsx": "Displays a watchlist management card showing demo-mode alerts and a button to add cryptocurrencies.",
  "frontend/src/components/WatchlistPriceTicks.tsx": "A card UI for live watchlist price ticks, currently showing a demo-mode alert.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries on change.",
  "frontend/src/hooks/useActorEnhanced.ts": "Wraps useActor with diagnostics, timeout handling, and retry logic for backend/admin initialization.",
  "frontend/src/hooks/useConnectionRecovery.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, managing login state, identity loading, and session handling.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, admin checks, roles, and placeholder crypto queries with unimplemented backend stubs.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light/dark themes, including color system and layout tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/BackendTesterPage.tsx": "Renders an admin diagnostic and testing interface showing permission status, identity info, and backend diagnostics.",
  "frontend/src/pages/Dashboard.tsx": "Displays the main dashboard with watchlist tools, popular crypto cards, and optional navigation to the backend tester.",
  "frontend/src/utils/backendTesterCommands.ts": "Defines a list of demo backend command configurations, including metadata, execution stubs, and output parsers.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session-based parameters, supporting hash and query routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom OKLCH-based color palette, extended theming, and animation/keyframe utilities with several plugins.",
  "project_state.json": "JSON metadata describing the project’s backend–frontend setup, known issues, and pending feature requests for Motoko debug endpoints and live market data fetching."
}