{
  "backend/main.mo": "Motoko canister providing admin-gated cycle checks, CoinGecko URL builders, user profile storage, and live market data outcall helpers.",
  "feature_evidence.json": "Feature evidence report listing watchlist UI features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for reference and planning.",
  "frontend/docs/coingecko-debug-dfx.md": "Guide explaining how to deploy and test raw CoinGecko API responses using dfx and an admin-only debug function.",
  "frontend/index.html": "Basic HTML entry point mounting the React application and loading the main script.",
  "frontend/src/App.tsx": "Main React app handling identity gating, routing, actor initialization, profile setup logic, and protected views.",
  "frontend/src/components/AddCryptoDialog.tsx": "Dialog showing a placeholder alert indicating crypto watchlist add functionality is not yet implemented.",
  "frontend/src/components/BackendTesterEntryPoint.tsx": "UI entry point for the backend tester with admin checks, loading/error states, and navigation handling.",
  "frontend/src/components/ConfigErrorBoundary.tsx": "Empty or placeholder file intended for configuration error handling component.",
  "frontend/src/components/ConnectionBootstrapper.tsx": "Manages authentication and backend-connection lifecycle with timeout handling, retry, and error UI.",
  "frontend/src/components/ConnectionDetails.tsx": "Expandable debug panel showing connection diagnostics with copy-to-clipboard support.",
  "frontend/src/components/ConnectionRecoveryDialog.tsx": "Placeholder or empty component file for a connection recovery dialog.",
  "frontend/src/components/CryptoCard.tsx": "Displays live crypto market data with error handling and opens a detail dialog for deeper analysis.",
  "frontend/src/components/CryptoDetailDialog.tsx": "Dialog showing crypto forecast charts and adjustable settings, resetting parameters on open.",
  "frontend/src/components/Footer.tsx": "Simple footer with copyright, attribution, and disclaimer text.",
  "frontend/src/components/ForecastChart.tsx": "Shows historical prices, moving averages, and forecasted values using regression with error and loading states.",
  "frontend/src/components/ForecastSettingsPanel.tsx": "Provides sliders to configure moving average period and forecast horizon for a crypto's analysis.",
  "frontend/src/components/Header.tsx": "Header component handling theme toggling, Internet Identity auth, user registration, and optional tester navigation.",
  "frontend/src/components/LoginPrompt.tsx": "Displays marketing features and prompts unauthenticated users to log in via Internet Identity.",
  "frontend/src/components/PriceEntryManager.tsx": "Empty placeholder component with no implemented logic.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for entering and saving a user's profile name using a backend mutation.",
  "frontend/src/components/SimulatedBashPanel.tsx": "Interactive command panel simulating a bash terminal with backend commands, auto-reconnect logic, and admin mode handling.",
  "frontend/src/components/WatchlistManager.tsx": "UI card for managing a crypto watchlist, currently showing a placeholder 'coming soon' alert.",
  "frontend/src/components/WatchlistPriceTickRow.tsx": "Fetches and displays live market data for a single crypto symbol with loading, error, and price-change indicators.",
  "frontend/src/components/WatchlistPriceTicks.tsx": "Renders a list of live price tick rows for selected crypto symbols or a placeholder if none are selected.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, including access control initialization and query invalidation.",
  "frontend/src/hooks/useActorEnhanced.ts": "React hook that wraps useActor and Internet Identity to provide enhanced state, timeout handling, admin init detection, and retry logic.",
  "frontend/src/hooks/useConnectionRecovery.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity auth, including login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend calls such as user profiles, admin checks, user roles, and crypto market data.",
  "frontend/src/index.css": "Tailwind CSS config defining theme variables, dark mode values, and global styling.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up QueryClient, and wraps the app in the InternetIdentityProvider.",
  "frontend/src/pages/BackendTesterPage.tsx": "Admin and diagnostics page showing caller details, role, access state, and tools for backend testing with retry options.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard displaying watchlists, live crypto data, and navigation to backend tester.",
  "frontend/src/utils/backendTesterCommands.ts": "Defines backend tester command metadata and execution logic, including market data fetch commands for BTC/ETH with response parsing and formatting.",
  "frontend/src/utils/coinGeckoHistoricalData.ts": "Parses CoinGecko historical price responses into sorted timestamp/price pairs with error handling for malformed data.",
  "frontend/src/utils/coinGeckoMarketData.ts": "Parses live CoinGecko market responses into structured price/change/market-cap data and provides formatting helpers.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, container settings, and enabling plugins like typography and container queries.",
  "project_state.json": "Tracks project state, issues, features, and architectural notes related to backend CoinGecko outcalls, mode config, and frontend integration."
}