{
  "kind": "build_request",
  "title": "Prevent CoinGecko outcalls from failing due to canister cycle exhaustion + add in-app cycle diagnostics",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Add backend cycle-safety checks for all CoinGecko HTTPS outcalls so the canister does not reach 0 cycles during `getLiveMarketData(symbol)` / `debugFetchCoinGecko(symbol)` execution. When the cycle balance is below a defined safety threshold, the backend must not attempt the outcall and must return a deterministic, user-facing English error message that clearly indicates the canister is low/out of cycles (and that an admin must top up cycles).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Fix Cycles Now"
        ]
      },
      "acceptanceCriteria": [
        "Calling `getLiveMarketData(\"BTC\")`/`(\"ETH\")`/`(\"XRP\")` when cycles are below the configured threshold returns a clear English error string indicating low/out-of-cycles and does not attempt the HTTPS outcall.",
        "Calling `debugFetchCoinGecko(\"BTC\")`/`(\"ETH\")`/`(\"XRP\")` when cycles are below the configured threshold returns the same class of clear low/out-of-cycles error and does not attempt the HTTPS outcall.",
        "When cycles are sufficient, both methods continue to perform the HTTPS outcall and return the raw response `Text` as they do today.",
        "No change to existing authorization rules: `getLiveMarketData` remains user-permission-gated; `debugFetchCoinGecko` remains admin-only."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Expose backend cycle diagnostics via new backend methods that the frontend can call without terminal/dfx access: a query method to return current canister cycle balance, plus a structured status method (e.g., balance + configured threshold + a human-readable status string) suitable for display in the in-app tester.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Fix Cycles Now"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method that returns the current cycle balance (as a numeric type that can be reliably displayed in the UI).",
        "Backend exposes a method that returns a cycle status payload that includes: current balance, the low-cycles threshold value used by the outcall guards, and a status indicator/message in English (e.g., OK/LOW/CRITICAL).",
        "Cycle status methods are callable from the existing frontend actor without requiring any changes to immutable frontend hook files."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Add an in-app Cycle Status view in the Backend Tester UI by introducing one or more tester commands (in `frontend/src/utils/backendTesterCommands.ts`) that call the new backend cycle diagnostics methods and render the results in a copy/paste-friendly format in the existing `SimulatedBashPanel`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Fix Cycles Now"
        ]
      },
      "acceptanceCriteria": [
        "A new diagnostic command (or commands) appears under an appropriate category (preferably “Phase 3: Diagnostic Tools”) to fetch and display cycle balance/status.",
        "Running the command prints a readable output showing at minimum: current cycle balance and the configured low-cycles threshold.",
        "The output is displayed in the existing terminal output area and is copyable like other command outputs."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Improve user-facing error handling on the Dashboard crypto cards so cycle-exhaustion failures are understandable: when the live market data request fails with an IC rejection containing ‘out of cycles’ / IC0504, show a concise English message indicating the backend is out of cycles and live data is temporarily unavailable until cycles are topped up.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Fix Cycles Now"
        ]
      },
      "acceptanceCriteria": [
        "When `useGetLiveMarketData(symbol)` errors with a message containing ‘out of cycles’ or ‘IC0504’, `frontend/src/components/CryptoCard.tsx` displays an English error message that explicitly mentions cycle exhaustion as the cause.",
        "Other errors continue to display their existing error behavior (do not replace all error messages with the cycles message).",
        "The new message does not mention demo mode and does not imply the user can self-fix without admin action."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor; all Motoko logic stays in `backend/main.mo`.",
    "Do not edit frontend files under `frontend/src/components/ui`, `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, or `frontend/src/main.tsx` (compose around them instead).",
    "Use English for any user-facing text.",
    "Do not add additional backend canisters/services for cycle management (single backend only)."
  ],
  "nonGoals": [
    "Implementing true ‘automatic top-ups’ from an external cycles wallet/ledger/cycles-minting flow (not possible purely from inside a single canister without external funding).",
    "Adding third-party monitoring/alerting integrations.",
    "Adding new product features unrelated to cycle reliability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}