{
  "kind": "build_request",
  "title": "Fix Watchlist Live Price Ticks to show live market data instead of “Coming Soon”",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Replace the hard-coded “Coming Soon” placeholder in `frontend/src/components/WatchlistPriceTicks.tsx` with a live list UI that fetches and displays live market data ticks using the existing `useGetLiveMarketData(symbol)` React Query hook and the existing CoinGecko parsing/formatting utilities.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-7",
          "recent-9"
        ],
        "quotes": [
          "Fix Live Price Ticks",
          "The screenshot shows the component is still hard‑coded to always show “Coming Soon.” There is no live price tick implementation and no wiring to your real watchlist data."
        ]
      },
      "acceptanceCriteria": [
        "The `WatchlistPriceTicks` card no longer renders the “Coming Soon” `Alert` by default.",
        "The component renders a list of one or more crypto symbols with at least: symbol label, formatted current price (USD), and a loading state per row.",
        "Each row’s live data is fetched via `useGetLiveMarketData(symbol)` and parsed with `parseCoinGeckoResponse()` from `frontend/src/utils/coinGeckoMarketData.ts`.",
        "If `useGetLiveMarketData` returns an error (including cycle exhaustion errors), the component shows a clear English error message in the card without crashing the page.",
        "No user-facing text mentions “Demo Mode”."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Wire `WatchlistPriceTicks` into the Dashboard so it receives a deterministic symbol list to display (until backend watchlist endpoints exist), and ensure the card header/subtitle remain accurate and non-misleading in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-7",
          "recent-9"
        ],
        "quotes": [
          "Fix Live Price Ticks",
          "fetches your actual watchlist from the backend • runs `useGetLiveMarketData()` for each symbol • displays price updates in the card instead of the placeholder message"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/pages/Dashboard.tsx` passes an explicit list of symbols into `WatchlistPriceTicks` (e.g., a subset of supported symbols such as BTC/ETH/XRP) rather than relying on an unimplemented backend watchlist.",
        "If the UI is not using a real backend watchlist yet, the card copy clearly states what is being shown (English) without implying the user’s personal watchlist is being loaded from the backend.",
        "The component only queries supported symbols (BTC/ETH/XRP) to avoid deterministic “Unsupported symbol” responses in the live ticks list.",
        "The Dashboard renders without TypeScript errors after the prop/wiring change."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` (compose existing shadcn components instead).",
    "Do not edit immutable paths: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Keep backend architecture single-actor; no new backend services or databases."
  ],
  "nonGoals": [
    "Implementing backend watchlist storage/endpoints (add/remove/list watchlist) in Motoko.",
    "Adding real-time streaming (WebSockets/push) for ticks; polling via React Query is sufficient.",
    "Changing CoinGecko backend outcall behavior beyond what’s needed for the UI to display existing live responses."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}