{
  "kind": "build_request",
  "title": "Fix Backend Tester output scrolling and correct demo/live mode messaging",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Backend Tester bottom output panel so it reliably scrolls (mouse wheel/trackpad, scrollbar drag, and touch) when command output exceeds the visible height, in both normal and maximized window states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "the bottom panel is still not scrollin"
        ]
      },
      "acceptanceCriteria": [
        "When the Backend Tester has enough output to overflow, the output area can be scrolled with mouse wheel/trackpad, scrollbar drag, and touch (where applicable).",
        "Scrolling works in both windowState='normal' and windowState='maximized'.",
        "The output panel does not get 'stuck' due to parent container overflow/height constraints; the output region remains the only scrollable region for output content.",
        "Auto-scroll-to-bottom continues to work when the user is at the bottom; if the user scrolls up, new output does not force-scroll them back down until they return to bottom."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Backend Tester UI and command definitions to stop showing a generic 'demo mode' message when live backend calls are being used; instead, accurately reflect live vs demo behavior based on the actual command implementation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "were still in demo mode even though the test are pulling live data"
        ]
      },
      "acceptanceCriteria": [
        "The note/banner text in the Backend Tester no longer implies the entire tester is in demo mode when at least some commands are live backend calls.",
        "Commands that call the canister (use the actor) are clearly indicated as Live, and commands that return mock data are clearly indicated as Demo (either via label/badge/description).",
        "Text is consistent between the command list and the informational note (no contradictions like 'demo mode' while running live calls).",
        "No user-facing text mentions Kraken/API sources that are not actually being used by the command implementation (e.g., remove or correct 'Kraken API' in demo placeholders if it confuses live status)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only).",
    "Do not modify frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain single-actor in backend/main.mo; only add migration.mo if persistent state schema changes are required."
  ],
  "nonGoals": [
    "Implementing full watchlist/forecast/alerts crypto backend features beyond what is needed for accurate tester messaging.",
    "Adding new authentication providers beyond Internet Identity.",
    "Adding real-time/WebSocket streaming."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}