{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Live Symbol Picker backed by backend validSymbols + watchlist mutations (frontend wiring)",
  "requirements": [
    {
      "id": "REQ-34",
      "summary": "Replace stubbed React Query hooks with live backend calls for valid symbols, watchlist read, and add-to-watchlist mutation; gate by actor readiness and Internet Identity initialization.",
      "acceptanceCriteria": [
        "`useGetValidSymbols` is enabled (not `enabled: false`) and calls the backend method that returns `validSymbols`.",
        "`useGetWatchlist` is enabled (not `enabled: false`) and calls the backend watchlist read method.",
        "`useAddCryptoToWatchlist` calls the backend `addCryptoToWatchlist` method and, on success, invalidates the `watchlist` query (and any other relevant dashboard queries that should reflect the change).",
        "All three hooks are gated behind `!!actor && !actorFetching && !isInitializing` in the same style as `useGetLiveMarketData` / `useGetHistoricalPriceData`.",
        "User-facing errors produced by these hooks are in English (no demo-mode messaging)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement live hooks: (1) `useGetValidSymbols` calling `actor.getValidSymbols()` and returning `CryptoSymbol[]`; (2) `useGetWatchlist` calling `actor.getWatchlist()`; (3) `useAddCryptoToWatchlist` calling `actor.addCryptoToWatchlist(symbol)` and invalidating `['watchlist']` on success. Gate all three with `!!actor && !actorFetching && !isInitializing` using the existing `useActor` + `useInternetIdentity` pattern. Ensure thrown errors are clear English strings (no demo-mode messaging). Use the selected `authorization` component guidance for frontend auth/initialization gating patterns and cache clearing behavior where relevant; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Create a reusable in-memory searchable SymbolPicker component for selecting a crypto symbol.",
      "acceptanceCriteria": [
        "A new component named `SymbolPicker` exists under `frontend/src/components/` (or an appropriate subfolder) and is used by the Add Crypto flow.",
        "The component renders a search input at the top and a list of available symbols below.",
        "Typing in the search input filters the displayed list using a standard JS/React filter approach (e.g., `array.filter(...)`) without requiring a backend call per keystroke.",
        "Filtering is case-insensitive and matches at least substrings of the symbol text (e.g., typing `et` matches `ETH`).",
        "If the filter yields zero results, the component shows a clear English empty state message (e.g., “No matching symbols.”)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SymbolPicker.tsx",
          "operation": "create",
          "description": "Create `SymbolPicker` component that accepts a list of available symbols and an `onSelect(symbol)` callback, renders a search input at the top and a scrollable list beneath, and filters via in-memory case-insensitive substring matching. Include an English empty-state message when no matches exist. Compose existing UI primitives (do not edit anything under `frontend/src/components/ui`). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AddCryptoDialog.tsx",
          "operation": "modify",
          "description": "Wire the new `SymbolPicker` into the Add Crypto flow (ensures the new component is not orphaned). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Replace AddCryptoDialog placeholder with live Symbol Picker powered by backend valid symbols and watchlist mutation feedback.",
      "acceptanceCriteria": [
        "`AddCryptoDialog.tsx` no longer renders the placeholder alert that says backend crypto functionality is not implemented.",
        "When the dialog opens, it fetches and displays the available symbols from the backend (via the new `useGetValidSymbols` hook).",
        "The dialog shows a loading state while symbols are being fetched and a clear English error message if fetching fails.",
        "Selecting a symbol triggers the add-to-watchlist mutation and provides immediate UI feedback (e.g., disabled state/spinner) while the mutation is in flight.",
        "After a successful add, the dialog closes (or otherwise clearly confirms success in English) and the rest of the dashboard reflects the updated watchlist via query invalidation/refetch."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AddCryptoDialog.tsx",
          "operation": "modify",
          "description": "Remove the current “Feature Not Available” placeholder alert and implement the live Add Crypto UX: use `useGetValidSymbols` to fetch symbols (show loading + English error state), render `SymbolPicker` with fetched symbols, and on selection call `useAddCryptoToWatchlist`. While the mutation is pending, provide immediate feedback (e.g., disable selection / show spinner). On success, close the dialog (and/or show an English confirmation) relying on React Query invalidation to refresh the dashboard watchlist. Do not introduce any “Demo Mode” messaging. Compose existing UI components without modifying `frontend/src/components/ui/*`. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Drive the dashboard’s live tick symbols from the backend watchlist and refresh immediately after additions.",
      "acceptanceCriteria": [
        "`frontend/src/pages/Dashboard.tsx` uses `useGetWatchlist` to determine the symbols passed into `WatchlistPriceTicks` (replacing the current hard-coded `liveTickSymbols`).",
        "After adding a symbol via Add Crypto, the watchlist-driven `WatchlistPriceTicks` list updates without requiring a full page reload.",
        "When the watchlist is empty, the existing empty-state message in `WatchlistPriceTicks` is shown (English).",
        "Any user-facing loading/error messaging introduced on the dashboard is in English and does not mention “demo mode”."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Replace the hard-coded `liveTickSymbols` with the result of `useGetWatchlist`, and pass that list into `WatchlistPriceTicks`. Add minimal English loading/error handling around the watchlist fetch if needed, ensuring the existing empty state in `WatchlistPriceTicks` remains the empty-watchlist UX. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}