{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix connection bootstrap stalling after cache clears and improve Watchlist cycle-exhaustion messaging",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Prevent indefinite “Connecting to backend” by enforcing a bounded connection bootstrap with actionable recovery UI when actor creation cannot complete (e.g., missing canister ID after site data clears).",
      "acceptanceCriteria": [
        "After clearing site data (cache/cookies/storage) and reloading while authenticated with Internet Identity, the app progresses out of the connecting state without requiring manual developer intervention.",
        "If the backend actor cannot be created due to missing/invalid configuration (including missing canister ID), the user sees an English error screen (not an infinite spinner) within 45 seconds with actionable buttons (Retry Connection, Re-authenticate, Refresh Page).",
        "The error screen includes enough diagnostic detail (via the existing ConnectionDetails panel) to confirm whether actor creation was attempted and why it failed.",
        "Retry actions actually trigger a new actor-creation attempt (not just re-rendering the same idle state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ConnectionBootstrapper.tsx",
          "operation": "modify",
          "description": "Update the bootstrap UI to time out within 45 seconds even when actorFetching becomes false but actorReady is still false (e.g., stuck 'idle' after cache clears). Ensure the error screen is shown (not a spinner) and includes Retry Connection, Re-authenticate, and Refresh Page actions, while keeping ConnectionDetails visible for diagnostics. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire ConnectionBootstrapper to receive a real actorError and a retry handler that triggers a new actor-creation attempt (not just a re-render). Ensure actorReady is computed from actor availability + error state so the UI cannot remain indefinitely in a connecting view. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/connectionErrors.ts",
          "operation": "create",
          "description": "Add shared frontend helpers to normalize actor-creation/configuration failures into meaningful English Error messages (including missing/invalid canister ID scenarios) for display in ConnectionBootstrapper and ConnectionDetails. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Harden actor initialization hooks to reliably surface actor-creation failures as Errors, transition diagnostics to 'error', and propagate failures to ConnectionBootstrapper / ConnectionDetails.",
      "acceptanceCriteria": [
        "When actor creation fails, the failure is exposed as a real Error (with a meaningful English message) that is shown by ConnectionBootstrapper.",
        "The diagnostics stage reported by useActorEnhanced transitions to 'error' when actor creation fails, rather than remaining 'idle' indefinitely.",
        "There is no state where the user is authenticated, but the app remains in a non-progressing 'idle' connection stage without either creating an actor or showing an error."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Extend the hook to expose actor creation failures (react-query error) and a retry/refetch mechanism that forces a new createActorWithConfig attempt. Ensure errors from core-infrastructure actor/config creation (including missing canister ID/misconfiguration) are caught and surfaced as meaningful English Errors instead of silent idle/loading. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useActorEnhanced.ts",
          "operation": "modify",
          "description": "Propagate errors from useActor into the enhanced state, ensuring diagnostics.stage becomes 'error' on failure and never remains 'idle' while authenticated without progress. Update retry() to invoke the underlying actor re-creation attempt (and only re-authenticate when appropriate), and include diagnostics details that confirm actor creation was attempted and why it failed. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ConnectionDetails.tsx",
          "operation": "modify",
          "description": "Ensure the diagnostics panel can display improved normalized error details (from the shared connection error helper) and clearly reflects the 'error' stage when actor creation fails. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Make Watchlist tick-row cycle-exhaustion errors user-understandable and consistent with the dashboard cycle error handling.",
      "acceptanceCriteria": [
        "In frontend/src/components/WatchlistPriceTickRow.tsx, cycle-exhaustion errors no longer display the generic 'Service unavailable' text; instead they display an English message that explicitly mentions the backend being out of cycles and that live data is temporarily unavailable until cycles are topped up.",
        "Non-cycle errors continue to show a non-misleading generic error state (e.g., 'Error loading'), distinct from the cycle-specific message.",
        "The tick rows still render successfully for symbols whose requests succeed, and failure messaging is isolated per row (one failing symbol does not break the whole list)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WatchlistPriceTickRow.tsx",
          "operation": "modify",
          "description": "Replace the cycle error label with a concise English message aligned with CryptoCard (e.g., indicate the backend canister is out of cycles and live data is temporarily unavailable until cycles are topped up). Keep non-cycle errors as a distinct generic message and ensure error handling remains isolated per row. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/connectionErrors.ts",
          "operation": "modify",
          "description": "Add/extend a shared detector for IC cycle-exhaustion failures (e.g., 'out of cycles', IC0504/IC0406 or equivalent) so WatchlistPriceTickRow and other UI areas can use consistent classification and messaging. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}