{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Watchlist Live Price Ticks: replace placeholder with live market tick list and wire into Dashboard",
  "requirements": [
    {
      "id": "REQ-26",
      "summary": "Implement `WatchlistPriceTicks` live list UI that fetches and renders per-symbol live market ticks via the existing React Query hook and CoinGecko parsing/formatting utilities, with robust error handling.",
      "acceptanceCriteria": [
        "The `WatchlistPriceTicks` card no longer renders the “Coming Soon” `Alert` by default.",
        "The component renders a list of one or more crypto symbols with at least: symbol label, formatted current price (USD), and a loading state per row.",
        "Each row’s live data is fetched via `useGetLiveMarketData(symbol)` and parsed with `parseCoinGeckoResponse()` from `frontend/src/utils/coinGeckoMarketData.ts`.",
        "If `useGetLiveMarketData` returns an error (including cycle exhaustion errors), the component shows a clear English error message in the card without crashing the page.",
        "No user-facing text mentions “Demo Mode”."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WatchlistPriceTicks.tsx",
          "operation": "modify",
          "description": "Replace the placeholder “Coming Soon” UI with a real list-based card that accepts a deterministic `symbols` prop, renders rows, aggregates and displays a clear in-card error message when any row fails (including cycle exhaustion-style messages), and uses existing shadcn-ui building blocks (e.g., Card/Alert) by composing them only (do not modify `frontend/src/components/ui/*`). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/WatchlistPriceTickRow.tsx",
          "operation": "create",
          "description": "Create a child row component used by `WatchlistPriceTicks` so each row can safely call `useGetLiveMarketData(symbol)` (avoiding hooks-in-loops). The row should parse responses with `parseCoinGeckoResponse()` and format prices with `formatPrice()` from `frontend/src/utils/coinGeckoMarketData.ts`, and provide a per-row loading indicator/state. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Wire `WatchlistPriceTicks` into the Dashboard with an explicit supported symbol list and accurate English card copy that does not imply a backend-backed personal watchlist.",
      "acceptanceCriteria": [
        "`frontend/src/pages/Dashboard.tsx` passes an explicit list of symbols into `WatchlistPriceTicks` (e.g., a subset of supported symbols such as BTC/ETH/XRP) rather than relying on an unimplemented backend watchlist.",
        "If the UI is not using a real backend watchlist yet, the card copy clearly states what is being shown (English) without implying the user’s personal watchlist is being loaded from the backend.",
        "The component only queries supported symbols (BTC/ETH/XRP) to avoid deterministic “Unsupported symbol” responses in the live ticks list.",
        "The Dashboard renders without TypeScript errors after the prop/wiring change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Pass a deterministic supported symbol array (BTC/ETH/XRP only) into `WatchlistPriceTicks` via props; update any surrounding copy or structure as needed so the UI does not imply a backend-loaded personal watchlist is being displayed. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/WatchlistPriceTicks.tsx",
          "operation": "modify",
          "description": "Update the card header/subtitle text to be accurate in English for a deterministic symbol list (not a backend watchlist), and ensure prop types align with the new Dashboard wiring. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}